var lore = {
	"loreMessages" : {
		"start0" : {
			"text" :
				"经过几天的元素修补后，我发现了魔像。\n"+
				"同时触摸所有这些物体会产生某种闪光。\n"+
				"我看见一个老人向我跑来，他的叫喊使我失去了知觉。\n"+
				"后来我在阁楼中间醒来，但其他的东西都不见了。\n\n"+
				"几个小时后，我恢复了体力，可以再次活动了。\n"+
				"走出房子给我带来了另一个惊喜。\n"+
				"看来我在那里很久了。 看着最新鲜的报纸上的日期...\n"+
				"7 个月前，我出去寻找机器零件。 7个月。\n\n"+
				"随着这个启示慢慢开始深入，我想起了我父亲的状态。\n"+
				"学者只给了他几个星期……我去了诊所。\n"+
				"\n----------------------------------------------------------------------------------\n\n"+
				"几个月来的悲伤，慢慢的变成了对那位目光中的老者的恨意。\n"+
				"如果不是他，我至少会在父亲最后一口气时陪在他身边。\n"+
				"我知道我想做什么。 我想回到那里。\n\n"+
				"我右臂上的融合元素手套不是老人想要的东西。\n"+
				"现在我能够同时在其中容纳两个不同的元素。\n"+
				"但每当我尝试做某事时，我的胸口就会出现白光\n"+
				"并在几秒钟后引起无效元素波。 这就像一个诅咒。\n\n"+
				"我仍然应该能够做我以前能做的所有事情，我只需要\n"+
				"改进我的设备。 于是我的准备工作开始了。\n"+
				"\n----------------------------------------------------------------------------------\n\n"+
				"几个月过去了。\n\n"+
				"我收集了更多的机器零件并重新制作了我上次使用的机器。\n"+
				"在那段时间里，我有两个重大发现。 第一 - 用我的手套制作的压缩晶体\n"+
				"有点不同。 它们似乎无限压缩元素。 应用它们\n"+
				"到机器和 宝珠 非常容易。 我将 4 个宝珠改造成房间大小的坦克\n"+
				"并为 魔像 实验收集了更多。 我想我已经准备好推动它了。\n\n"+
				"使用新晶体，我能够逆向工程它们如何连接到另一侧。\n"+
				"我应该能够制造一个小裂缝并直接从中拉出元素。\n"+
				"\n----------------------------------------------------------------------------------"
		},
		"rifts0" : {
			"text" :
				"我不认为我能够单独使用 裂痕 达到足够高的元素数量。\n"+
				"问题是……我不知道我奶奶阁楼上的催化剂是怎么做的。\n"+
				"好吧，我将重新塑造它的形状，然后我们将看看它是如何从那里开始的。\n\n"+
				"那很有意思。 我真的不明白为什么它会提高反应效率，但是\n"+
				"用空气包围它似乎也能提高反应速度。\n"+
				"我认为将火集中在催化剂周围可以减少自然障碍并拉动更多\n"+
				"与裂隙同源的元素。\n\n"+
				"无论如何，准备好催化剂后，我只需要将其安装在房间中间。\n"+
				"\n----------------------------------------------------------------------------------"
		},
		"catalyst0" : {
			"text" :
				"由我的诅咒引起的元素波集中在催化剂上，很快就将其粉碎。\n"+
				"我猜围绕它的波浪的应变太强了。\n"+
				"至少从头开始创建 催化剂 给了我一些额外的知识\n"+
				"关于元素。 我将修改 催化剂 以用于转换机器的外部。\n"+
				"给它一个环形将在更大的表面上传播波浪力。 应该够了。\n"+
				"\n----------------------------------------------------------------------------------"
		},
		"catalyst1" : {
			"text" :
				"是的，它有效！ 可悲的是，新的催化剂结构似乎要弱得多。\n"+
				"但从长远来看，我仍然应该能够获得大量的元素。\n\n"+
				"现在是时候专注于我的目标了，找回一些魔像。\n"+
				"我不想再随意造成他们的创作，所以我设计了特殊的机器。\n"+
				"输液室可以让我用阀门控制流程。 用几十\n"+
				"空宝珠我甚至可以尝试制作多个相同类型的魔像。\n"+
				"我迫不及待地想探索新的可能性。\n"+
				"\n----------------------------------------------------------------------------------"
		},
		"stash0" : {
			"text" :
				"每次创建魔像时都会丢失所有元素，这会大大减慢我的进度。\n"+
				"但是看到元素波“感谢”我的诅咒，我能够更好地理解它。\n"+
				"波使用自然出现的少量元素在空间中传播\n"+
				"在我周围的世界。 我的诅咒波比魔像弱一点，\n"+
				"所以他们只能进入我在升级过程中使用的坦克。 这意味着一个简单的\n"+
				"隔离屏障应该能够阻止波浪进入我的容器。\n\n"+
				"可悲的是，在我的罐内使用该屏障会使它们无法使用\n"+
				"我现在的子空间管道技术，我应该还能做出一个特殊的容器\n"+
				"那将是安全的海浪。 将元素泵入和抽出它会出现问题。\n"+
				"嗯，我有一个计划。 我将只能检索一小部分存储的元素\n"+
				"在升级或魔像创建过程中创建的每一波之后，但它更好\n"+
				"比从头开始\n"+
				"\n----------------------------------------------------------------------------------"
		},
		"merge0" : {
			"text" :
				"魔像产生的元素波将另一波拉向它，黑暗包围了他们。\n"+
				"我认为这个过程是由于房间里存在大量元素而开始的。\n\n"+
				"经过一段时间的剧烈旋转，两个魔像合二为一。\n"+
				"那是……疯了。 只有 4 个元素。 新的里面有什么？ 我无法互动\n"+
				"用我戴着手套的手臂。 现在我只需要确保这次事故不会发生\n"+
				"再次发生。 从现在开始，我会把所有的魔像放在稳定的基座上。\n\n\n"+
				"尝试新的魔像是我做过的最有趣的事情。\n"+
				"虽然我使用普通的魔像来帮助收集它们各自的元素，但我不能\n"+
				"对这个做同样的事情。 但它散发出一种微弱的光环，在整个房间里蔓延开来，\n"+
				"它似乎以某种奇怪的方式增强了我的机器。 我会尝试记录下的细节\n"+
				"那个权力以后。 现在的问题是……如果基础魔像的组合创造了这个，\n"+
				"那么当我尝试另一种组合时会发生什么？\n\n"+
				"多亏了我在创建 魔像 方面的所有经验，我才能够构建小版本\n"+
				"宝珠。 我只需要一点元素就可以把它们变成魔像，但它们会在之后消散\n"+
				"几分钟。 由于它们的大小，我能够将它们的波浪包含在内部进行单独研究。\n"+
				"有了他们，我做了更多的测试，实际上所有基础魔像的组合都创造了不同的\n"+
				"“高级”魔像。 我也测试了他们的能力，他们当时大不相同\n"+
				"我以前见过的任何东西。 我的下一个目标应该是尽可能多地制作它们。\n"+
				"\n----------------------------------------------------------------------------------"
		},
		"eat0" : {
			"text" :
				"两个同类型的魔像似乎无法在狭小的空间内共存。\n"+
				"元素波使它们连接起来，不久之后，一个吸干了另一个，\n"+
				"只是让新创建的魔像处于不稳定状态，导致小爆炸\n"+
				"白光。 那个该死的老头又插手了？\n"+
				"\n----------------------------------------------------------------------------------"
		},
		"infernal0" : {
			"text" :
				"我决定将其命名为“地狱火”的魔像感觉很特别。\n"+
				"不仅看起来它是组合魔像中最强大的，它还有这个奇怪的\n"+
				"趋势。 我的计算表明它产生所有元素的能力将下降到\n"+
				"在某些时候什么都没有。 我怀疑在点之后它实际上会开始流失\n"+
				"来自我系统的元素。 我真的不知道在那之后会做什么，但是\n"+
				"很明显我需要到达那里。"
		},
		"infernal1" : {
			"text" :
				"我的怀疑是对的。 我一跨过 1e90 门槛，地狱火魔像就反转了\n"+
				"它的力量并开始吸取元素，我拥有的吸取越多。\n"+
				"它的大小也随着其流失率而增长。\n\n"+
				"我认为给它足够的所有元素应该会在某个时候满足它。\n"+
				"我只希望我的反应足够强烈以维持它。\n"+
				"\n----------------------------------------------------------------------------------"
		},
		"ending0" : {
			"text" :
				"一旦 地狱 达到最大尺寸，它就会从基座升到空中并\n"+
				"开始反复发送巨大的元素波。\n\n"+
				"第一波从 元素 中清除了我所有的机器，甚至是我的 存储。\n"+
				"第二波破坏了所有其他魔像\n\n"+
				"巨大的疼痛淹没了我的手套右臂。 我僵在原地无法抗争。\n\n"+
				"第三波将我所有的机器都打到墙上，在房间周围形成了一个临时的尖刺屏障。\n"+
				"第四波使其他魔像爆炸成次要元素波。\n\n"+
				"两件事几乎同时发生：\n"+
				"----------------------------------------------------------------------------------\n"+
				"其中一面墙上出现了明亮的白光。\n"+
				"来自魔像的二次波到达了地狱火并开始改变他。\n"+
				"----------------------------------------------------------------------------------\n"+
				"老者的身影踏进了光墙之中。\n"+
				"炼狱魔像的目光集中了起来，环顾了房间。\n"+
				"----------------------------------------------------------------------------------\n"+
				"老头子注意到了我，转头看向我。 \"你...\"\n"+
				"地狱火魔像停止了波动，身体微微缩了缩。\n"+
				"----------------------------------------------------------------------------------\n"+
				"一根手指指向了我。 “我不能让你这样做。”\n"+
				"地狱火突然向我袭来。\n"+
				"----------------------------------------------------------------------------------\n"+
				"\“对不起。\” - 瞬间光束指向我的胸口，起初微弱，但温暖。\n"+
				"我的魔像从我的左侧击中了我，并将我推入了我右侧的尖刺墙。\n"+
				"----------------------------------------------------------------------------------\n"+
				"我认为石巨人从光中受到了打击。 我眨了眨眼。\n"+
				"地狱火消失了。 光也不见了。 老者与书中的炼金术士长得一模一样。\n"+
				"我撞到墙上，感觉到尖刺刺穿了我的身体。 一种新的痛苦。\n"+
				"老人说：“我猜是那些钉子代替了我”\n"+
				"只见老者转身朝墙内走去。\n"+
				"“至少我戴手套的手臂不再感到疼痛了..”是我之前的最后一个想法\n"+
				"失去意识。\n"+
				"\n----------------------------------------------------------------------------------\n\n"+
				"几个小时后：\n"+
				"我在地板上醒来。 我起来了。 没有疼痛，移动没有问题。\n"+
				"在我为准备工作而度过的几个不眠之夜中，我感觉并不好。\n"+
				"困惑的我环顾四周。 墙上的钉子。 所以它确实发生了。 离我最近的尖峰\n"+
				"还满身是血，但我没有任何伤口。 我的身体看起来就像\n"+
				"一直到我注意到左臂上的玻璃球，标记了我所在的位置\n"+
				"被地狱火击中。 那是……在这一点上，我什至不感到惊讶。\n"+
				"我开始思考这意味着什么以及我如何使用它......\n\n"+
				"一边想着，一边注意到附近地板上的另一个小玻璃球。\n"+
				"我猜那些是地狱魔像的遗迹。 我伸手去捡，但是\n"+
				"它被我的手吸收，紫色的小球出现在我自己的球体中。\n\n\n"+
				"\n----------------------------------------------------------------------------------"+
				"\n----------------------------------------------------------------------------------"+
				"\n----------------------------------------------------------------------------------"+
				"\n----------------------------------------------------------------------------------\n\n"+
				"这标志着第二阶段的结束。 谢谢你来玩！\n"+
				"您现在可以查看第三阶段主要机制的先睹为快。\n"+
				"单击主设置中间的圆圈。\n\n\n\n"+
				"如果你喜欢这个游戏，请考虑支持我。\n"+
				"我很想在这个游戏上全职工作。\n"+
				"\n----------------------------------------------------------------------------------\n\n\n"+
				"鸣谢\n\n\n"+
				"Production director\n"+
				"Nagshell\n\n"+
				"Art Design\n"+
				"Nagshell\n\n"+
				"Programming\n"+
				"Nagshell\n\n"+
				"Public Relations\n"+
				"Nagshell\n\n"+
				"Moral Support\n"+
				"Silent but Deadly, Essi\n"+
				"Loud sub-woof-er, Baster\n\n"+
				"Supporters on Patreon\n"+
				"\n"+
				"PhantomLemon\n"+
				"ranger10700\n"+
				"Slav\n"
				},
		
	},//"\n"+
	"popupMessages" : {
		"catalyst0" : {
			"text" : 
				"由我的诅咒引起的元素波集中在催化剂上。\n"+
				"然后很快就将它粉碎成碎片。",
			//"changeTab" : 0
		},
		"merge0" : {
			"text" :
				"另一个 宝珠 内爆成一个 魔像，波浪到达了另一个 魔像。\n\n"+
				"黑暗充满了 宝珠 注入器。\n\n"+
				"我冲到房间中央看看发生了什么事。"
		},
		"eat0" : {
			"text" :
				"一个新的魔像产生的元素波到达了另一个同类型的魔像。\n"+
				"有什么不对的..."
		},
		
	},
	"bannerMessages" : {
		"overflow0" : {
			"text" : "打开所有转换机阀门以创建回路。"
		},
		"upgradeCost0" : {
			"text" : "诅咒清除升级中使用的元素，包括相应的罐子和机器。"
		},
		"machineSpeed0" : {
			"text" : "旋转速度乘以转换速度。 使用高度升级的催化剂非常有效。"
		},
		"pun0" : {
			"text" : "您慢慢开始看到滚动文本。 幽灵般的。"
		},
		"pun1" : {
			"text" : "突然之间，没有什么特别感兴趣的事情发生。"
		},
		"pun2" : {
			"text" : "嗯，你想听一个关于纸的笑话吗？ 它是可撕裂的。"
		},
		"pun3" : {
			"text" : "如果您喜欢游戏，请考虑支持我 \\('_' )."
		},
		"pun4" : {
			"text" : "突然之间，没有什么特别感兴趣的事情发生。"
		},
		"pun5" : {
			"text" : "不，蛋黄酱永远不会成为 元素 之一。 不要写关于它的歌曲。"
		},
		"pun6" : {
			"text" : 
				"您是否注意到每次听到双关语都变得越来越有趣?"+
				"                                                                                           "+
				"您是否注意到每次听到双关语都变得越来越有趣?"+
				"                                                                                           "+
				"您是否注意到每次听到双关语都变得越来越有趣？"
		},
		"pun7" : {
			"text" : "庞德克斯禁止入内 - 开始为我的 双关语 充电。"
		},
		"pun8" : {
			"text" : "不."
		},
		"pun9" : {
			"text" : "您无法通过向 魔像 投掷 宝珠 来捕捉 魔像。 我试过了.."
		},
		"pun10" : {
			"text" : "第一个阿尔卡历史学家有 Discord！"
		}
	},
	
	"addLore" : function(loreId) {
		var messageLines = lore.loreMessages[loreId].text.split('\n');
		dynamicData.lore.messages.push("");
		for(var i=0;i<messageLines.length;i++) {
			dynamicData.lore.messages.push(messageLines[i]);
		}
		dynamicData.lore.maxScroll += 20*(1+messageLines.length);
		dynamicData.tabStatus[2].highlight = true;
	},
	"activatePopup" : function(popupId) {
		dynamicData.popupActive = popupId;
		if(lore.popupMessages[popupId].changeTab) {
			tempData.activeTab = lore.popupMessages[popupId].changeTab;
		}
	},
	"disablePopup" : function() {
		dynamicData.popupActive = null;
	},
	"addBannerMessage" : function(bannerId) {
		if(tempData.currentBanner) {
			tempData.nextBanners.push(bannerId);
		} else {
			tempData.currentBanner = lore.bannerMessages[bannerId];
		}
	},
	"bannerScroll" : function(ctx) {
		tempData.currentBannerPosition -= tempData.bannerSpeed;
		if(!tempData.currentBanner.bannerLength) {
			tempData.currentBanner.bannerLength = estimateBannerLength(tempData.currentBanner.text,ctx);
		}
		
		if(tempData.currentBanner.bannerLength + tempData.currentBannerPosition < 120) {
			tempData.currentBannerPosition = 780;
			if(tempData.nextBanners.length > 0) {
				tempData.currentBanner = lore.bannerMessages[tempData.nextBanners.shift()];
			} else {
				tempData.currentBanner = null;
			}
		}
	},
	"idleBanner" : function() {
		if(lore.bannerMessages["pun"+dynamicData.punCounter]) {
			lore.addBannerMessage("pun"+dynamicData.punCounter++);
		} else {
			dynamicData.punCounter = 0;
			lore.addBannerMessage("pun"+dynamicData.punCounter++);
		}
	}
}
